src/bsl/DataProcessors/гкс_ВыгрузкаСтатистикиСообщенийRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>гкс_ВыгрузкаСтатистикиСообщенийRMQ</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СостоянияВходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СостоянияВходящихСообщений</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияВходящихСообщенийRMQ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ВходящиеСообщенияRMQ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДатаСобытияВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СостоянияИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СостоянияИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Состояние</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияИсходящихСообщенийRMQ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестноеВремя</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Сообщение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсходящиеСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УчастникОбмена</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_УчастникиОбменаRMQ</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УниверсальнаяДатаСобытияВМиллисекундах</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Enums/гкс_СостоянияВходящихСообщенийRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияВходящихСообщенийRMQ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВОбработке</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрировано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработкиЗакрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/Enums/гкс_СостоянияИсходящихСообщенийRMQ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>гкс_СостоянияИсходящихСообщенийRMQ</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоставленоИОбработано</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработкиПолучателем</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пропущено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаФормированияСостояния</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаОбработкиЗакрыто</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/bsl/DataProcessors/гкс_ВыгрузкаСтатистикиСообщенийRMQ/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
// Отправка статистики сообщений.
//
// Параметры:
//  ТипСообщений - Строка
Процедура ОтправкаСтатистикиСообщений(ТипСообщений) Экспорт
	Запрос = Новый Запрос;

	ЭтоВходящие = (ТипСообщений = "Входящие");
	СостоянияНеОбработано = Новый Массив;
	СостояниеОшибка = Новый Массив;


	Если ЭтоВходящие Тогда
		Запрос.Текст = ЗапросСостояниеВходящихСообщений();
		СостоянияНеОбработано.Добавить(Перечисления.гкс_СостоянияВходящихСообщенийRMQ.Зарегистрировано);
		СостоянияНеОбработано.Добавить(Перечисления.гкс_СостоянияВходящихСообщенийRMQ.ВОбработке);

		СостояниеОшибка.Добавить(Перечисления.гкс_СостоянияВходящихСообщенийRMQ.ОшибкаОбработки);

	Иначе
		Запрос.Текст = ЗапросСостояниеИсходящихСообщений();

		СостоянияНеОбработано.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.Подготовлено);

		СостояниеОшибка.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаОбработкиПолучателем);
		СостояниеОшибка.Добавить(Перечисления.гкс_СостоянияИсходящихСообщенийRMQ.ОшибкаФормированияСостояния);

	КонецЕсли;



	Запрос.УстановитьПараметр("Состояние", СостоянияНеОбработано);
	Запрос.УстановитьПараметр("СостояниеОшибка", СостояниеОшибка);

	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат;
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Выборка.Следующий();

	СтрокаСоединенияИнформационнойБазы = СтрокаСоединенияИнформационнойБазы();

	ИмяБазы = "";

	Если Не гкс_ОбщегоНазначенияКлиентСервер.ИнформационнаяБазаФайловая(СтрокаСоединенияИнформационнойБазы) Тогда
		ПараметрыСоединения = гкс_СтроковыеФункцииКлиентСервер.ПараметрыИзСтроки(СтрокаСоединенияИнформационнойБазы());
		ПараметрыСоединения.Свойство("Ref", ИмяБазы);
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ИмяБазы) Тогда
		Возврат;
	КонецЕсли;


	СтруктураСообщения = Новый Структура;
	СтруктураСообщения.Вставить("DateTime", XMLСтрока(ТекущаяДатаСеанса()));
	СтруктураСообщения.Вставить("BaseName", ИмяБазы);
	СтруктураСообщения.Вставить("Type", ТипСообщений);
	СтруктураСообщения.Вставить("MessageCount", Выборка.Всего);
	СтруктураСообщения.Вставить("Unprocessed", Выборка.НеОбработано);
	СтруктураСообщения.Вставить("ErrorCount", Выборка.Ошибки);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураСообщения);

	Сообщение = ЗаписьJSON.Закрыть();
	гкс_ОчередьСообщенийRMQ.ПроизвольноеСообщениеRMQ(Сообщение);

КонецПроцедуры
#КонецОбласти


#Область СлужебныеПроцедурыИФункции
Функция ЗапросСостояниеВходящихСообщений()
	Возврат "ВЫБРАТЬ
	|	гкс_СостоянияВходящихСообщений.Сообщение КАК Сообщение,
	|	МАКСИМУМ(гкс_СостоянияВходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах) КАК
	|		УниверсальнаяДатаСобытияВМиллисекундах
	|ПОМЕСТИТЬ ВТ_ДатыВходящих
	|ИЗ
	|	РегистрСведений.гкс_СостоянияВходящихСообщений КАК гкс_СостоянияВходящихСообщений
	|СГРУППИРОВАТЬ ПО
	|	гкс_СостоянияВходящихСообщений.Сообщение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сообщение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НеОбработано КАК НеОбработано,
	|	Т.Ошибки КАК Ошибки,
	|	Т.Всего КАК Всего
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(гкс_СостоянияВходящихСообщений.Сообщение) КАК НеОбработано,
	|		NULL КАК Ошибки,
	|		NULL КАК Всего
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияВходящихСообщений КАК гкс_СостоянияВходящихСообщений
	|			ПО ВТ_ДатыВходящих.Сообщение = гкс_СостоянияВходящихСообщений.Сообщение
	|			И
	|				гкс_СостоянияВходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = ВТ_ДатыВходящих.УниверсальнаяДатаСобытияВМиллисекундах
	|	ГДЕ
	|		гкс_СостоянияВходящихСообщений.Состояние В (&Состояние)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		0,
	|		КОЛИЧЕСТВО(гкс_СостоянияВходящихСообщений.Сообщение),
	|		NULL
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияВходящихСообщений КАК гкс_СостоянияВходящихСообщений
	|			ПО ВТ_ДатыВходящих.Сообщение = гкс_СостоянияВходящихСообщений.Сообщение
	|			И
	|				гкс_СостоянияВходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = ВТ_ДатыВходящих.УниверсальнаяДатаСобытияВМиллисекундах
	|	ГДЕ
	|		гкс_СостоянияВходящихСообщений.Состояние В (&СостояниеОшибка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		0,
	|		0,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДатыВходящих.Сообщение)
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.НеОбработано,
	|	Т.Ошибки,
	|	Т.Всего";
КонецФункции

Функция ЗапросСостояниеИсходящихСообщений()
	Возврат "ВЫБРАТЬ
	|	гкс_СостоянияИсходящихСообщений.Сообщение КАК Сообщение,
	|	МАКСИМУМ(гкс_СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах) КАК
	|		УниверсальнаяДатаСобытияВМиллисекундах
	|ПОМЕСТИТЬ ВТ_ДатыВходящих
	|ИЗ
	|	РегистрСведений.гкс_СостоянияИсходящихСообщений КАК гкс_СостоянияИсходящихСообщений
	|СГРУППИРОВАТЬ ПО
	|	гкс_СостоянияИсходящихСообщений.Сообщение
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сообщение
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Т.НеОбработано КАК НеОбработано,
	|	Т.Ошибки КАК Ошибки,
	|	Т.Всего КАК Всего
	|ИЗ
	|	(ВЫБРАТЬ
	|		КОЛИЧЕСТВО(гкс_СостоянияИсходящихСообщений.Сообщение) КАК НеОбработано,
	|		NULL КАК Ошибки,
	|		NULL КАК Всего
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияИсходящихСообщений КАК гкс_СостоянияИсходящихСообщений
	|			ПО ВТ_ДатыВходящих.Сообщение = гкс_СостоянияИсходящихСообщений.Сообщение
	|			И
	|				гкс_СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = ВТ_ДатыВходящих.УниверсальнаяДатаСобытияВМиллисекундах
	|	ГДЕ
	|		гкс_СостоянияИсходящихСообщений.Состояние В (&Состояние)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		0,
	|		КОЛИЧЕСТВО(гкс_СостоянияИсходящихСообщений.Сообщение),
	|		NULL
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СостоянияИсходящихСообщений КАК гкс_СостоянияИсходящихСообщений
	|			ПО ВТ_ДатыВходящих.Сообщение = гкс_СостоянияИсходящихСообщений.Сообщение
	|			И
	|				гкс_СостоянияИсходящихСообщений.УниверсальнаяДатаСобытияВМиллисекундах = ВТ_ДатыВходящих.УниверсальнаяДатаСобытияВМиллисекундах
	|	ГДЕ
	|		гкс_СостоянияИсходящихСообщений.Состояние В (&СостояниеОшибка)
	|
	|	ОБЪЕДИНИТЬ ВСЕ
	|
	|	ВЫБРАТЬ
	|		0,
	|		0,
	|		КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВТ_ДатыВходящих.Сообщение)
	|	ИЗ
	|		ВТ_ДатыВходящих КАК ВТ_ДатыВходящих) КАК Т
	|СГРУППИРОВАТЬ ПО
	|	Т.НеОбработано,
	|	Т.Ошибки,
	|	Т.Всего";
КонецФункции
#КонецОбласти


#КонецЕсли
